/*5. Разработать набор классов (минимум 5 классов, связи между
классами: агрегация, композиция, наследование) по предметной области
«Канцелярские принадлежности». Функционал программы должен
позволить собрать заказ. Сгенерировать минимум пять типов
исключительных ситуаций. Реализовать перенаправление исключительных
ситуаций. Сгенерировать минимум одну исключительную ситуацию с
оператором new. Создать исключительную ситуацию в конструкторе и
продемонстрировать вызов конструкторов и деструкторов. Задать
собственную функцию завершения. Создать собственный (пользовательский)
класс исключения, сгенерировать исключение этого типа и обработать его.*/